export const mockSchedules = {
  "2025-04-14": [
    {
      "id": 1,
      "title": "치과 예약",
      "start_time": "2025-04-14T10:00:00",
      "end_time": "2025-04-14T11:00:00"
    }
  ],
  "2025-04-20": [
    {
      "id": 2,
      "title": "친구랑 약속",
      "start_time": "2025-04-20T13:30:00",
      "end_time": "2025-04-20T15:00:00"
    },
    {
      "id": 3,
      "title": "운동하기",
      "start_time": "2025-04-20T17:00:00",
      "end_time": "2025-04-20T18:00:00"
    },
    {
        "id": 4,
        "title": "운동하기",
        "start_time": "2025-04-20T17:00:00",
        "end_time": "2025-04-20T18:00:00"
      },
      {
        "id": 5,
        "title": "운동하기",
        "start_time": "2025-04-20T17:00:00",
        "end_time": "2025-04-23T18:00:00"
      }
  ],
  "2025-04-16": [
    {
      "id": 6,
      "title": "팀 미팅",
      "start_time": "2025-04-16T14:00:00",
      "end_time": "2025-04-16T15:30:00"
    }
  ]
}; 